# InvalidHeaderText Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTableErrorInfo..::..InvalidHeaderText Property
FamilySizeTableErrorInfo Class See Also
---
The invalid header text.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string InvalidHeaderText { get; }
```

Visual Basic
---
```text
Public ReadOnly Property InvalidHeaderText As String
	Get
```

Visual C++
---
```text
public:
property String^ InvalidHeaderText {
	String^ get ();
}
```

# See Also
FamilySizeTableErrorInfo Class
Autodesk.Revit.DB Namespace